var PRE = [
  { n: 'Жестокий', k: 'phys', v: [4, 10] },
  { n: 'Пылающий', k: 'spell', v: [4, 10] },
  { n: 'Вампирский', k: 'leech', v: [2, 6] },
  { n: 'Гигантский', k: 'hp', v: [5, 12] },
  { n: 'Мудрый', k: 'mp', v: [8, 18] },
  { n: 'Яростный', k: 'critd', v: [8, 22] },
  { n: 'Стойкий', k: 'armor', v: [5, 12] },
  { n: 'Свирепый', k: 'dmg', v: [3, 8] },
  { n: 'Кровавый', k: 'str', v: [2, 6] },
  { n: 'Хищный', k: 'dex', v: [2, 6] },
  { n: 'Астральный', k: 'int', v: [2, 6] },
  { n: 'Шипастый', k: 'thorns', v: [3, 8] },
  { n: 'Непробиваемый', k: 'block', v: [2, 5] }
];

var SUF = [
  { n: 'точности', k: 'crit', v: [1, 4] },
  { n: 'ветра', k: 'evade', v: [1, 4] },
  { n: 'удачи', k: 'luk', v: [2, 5] },
  { n: 'алчности', k: 'gf', v: [5, 15] },
  { n: 'прозрения', k: 'xp', v: [4, 10] },
  { n: 'сокровищ', k: 'mf', v: [5, 15] },
  { n: 'жизни', k: 'vit', v: [2, 6] },
  { n: 'быстроты', k: 'spd', v: [2, 6] }
];

var SUF2 = SUF.concat([
  { n: 'огнеупорности', k: 'resfire', v: [4, 10] },
  { n: 'гнилостойкости', k: 'respoison', v: [4, 10] },
  { n: 'морозостойкости', k: 'resice', v: [4, 10] },
  { n: 'громоотводности', k: 'reslight', v: [4, 10] },
  { n: 'тенеустойчивости', k: 'resshadow', v: [4, 10] },
  { n: 'шипов', k: 'thorns', v: [4, 10] },
  { n: 'бастиона', k: 'block', v: [3, 8] }
]);

var RAR = ['Обычный', 'Волшебный', 'Редкий', 'Эпический', 'Легендарный'];
var RC = ['c0', 'c1', 'c2', 'c3', 'c4'];
var RMUL = [1, 1.6, 2.6, 4.2, 6.5];
var LEGN = [
  'Пепел и Сталь', 'Клятва Последнего', 'Эхо Пустоты', 'Венец Сгоревших', 'Зуб Лютоволка',
  'Слеза Арахны', 'Жатва Мортиса', 'Сердце Вулкана', 'Шёпот Полуночи', 'Колокол Утопленника',
  'Уголь Горнила', 'Псалом Пепла', 'Доспех Шипов', 'Стена Грейхолда', 'Рукавицы Палача',
  'Пепельный Жнец', 'Сапоги Странника', 'Кольцо Вампира', 'Корона Безумия', 'Лук Ветра'
];